<template>
  <div></div>
</template>

<script>
export default {
  data() {
    return {
      idiomList: [
        {
          title: '源远流长',
          description: '源头远，水流长。 也比喻历史悠久',
        },
        {
          title: '连绵不绝',
          description: '连绵不绝，就是连绵不断。连续而不中断。',
          example:
            '中华名族精神之所以连绵不绝、代代相传、历久弥新，是因为其有着深厚的历史土壤和文化根脉。',
        },
        {
          title: '博大精深',
          description:
            '广大，精湛深刻。形容学识、思想、理论广博丰富，精湛深刻。',
        },
        // 历久弥新
        {
          title: '历久弥新',
          description: '历经长久的时间更加鲜活，更加有活力，更有价值。',
          example:
            '中华名族精神之所以连绵不绝、代代相传、历久弥新，是因为其有着深厚的历史土壤和文化根脉。',
        },
        // 兼收并蓄
        {
          title: '兼收并蓄',
          description:
            '并，一起。蓄，积聚，储存。对不同的人和事物都能同时收容，保留。',
          example:
            '中国有厚重的文化底蕴，加上兼收并蓄的好学传统，经过时间的沉淀，这些优势渐渐显露出来。',
        },
      ],
    }
  },
}
/**
 * （单选题） 中国文化的博大精深，来源于其内部生成的________；中国文化的________，取决于其变迁过程中各种元素、层次、类型在内容和结构上通过碰撞、________、融合而产生的革故鼎新的强大动力。依次填入划横线部分最恰当的一项是：
 * A. 绵延不绝 长盛不衰 交流
 * B. 源远流长 与时俱进 对话
 * C. 多姿多彩 历久弥新 解构   🐶
 * D. 千姿百态 推陈出新 重构
 */
</script>

<style lang="scss" scoped></style>
